// import.java.until.List;
// package lessons6;

// import java.util.List;

// //     1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для приложения, которое является
//     // а) информационной системой ветеринарной клиники (кличка, порода, окрас, вес прививки)
//     // б) архивом выставки котов (порода, кличка, ФИО хозяин, родословная)
//     // в) информационной системой Театра кошек Ю. Д. Куклачёва (навыки, фотогеничность, агрессивность, кол-во выступлений)
//     // Можно записать в текстовом виде, не обязательно реализовывать в java. 

// public class Cat {
//     private String color; // использовать для полей - окрас   
//     private String bread; //порода 
//     private String name; // кличка 
//     private double wigth; // вес
//     private int age; // возраст
//     private boolean sex; // пол
//     private List <String> vac; // вакцина


    
   
// }
